<?php
header('content-type:text/html;charset=utf-8');
//整数取余,最终的结果符号(正数还是负数)与被除数相同
echo 7 % 3, '<hr>'; //1
echo 7.9 % 3, '<hr>'; //1
echo 7 % -3, '<hr>'; //1
echo -7.9 % 3, '<hr>'; //-1
////////////////////////////////////////
$str = '中';
$str .= '国'; //中国
echo $str, '<hr>';
$str = '中';
$str = '初' . $str;
echo $str, '<hr>';
////////////////////////////////////////
//strpos,返回一个字符串在另一个字符串中第一次出现的位置
//1.字符从0开始编号
//2.如果没有出现则返回false
//因为if语句的条件表达式必须为布尔型结果
//而现在返回的结果是整数0,所以要根据转换原则将整数转换成
//布尔型,所以0转换成为false
if (strpos('abc', 'a') !== false) {
	echo '指定字符出现<hr>';
} else {
	echo '没有出现<hr>';
}
////////////////////////////////////////
$n = 5;
echo $n++, '<hr>'; //先使用,后加减
echo $n; //6
////////////////////////////////////////
//短路求值
$n = 1;
$m = 3;
if ($n-- || ++$m) {
	$n++;
	$m++;
}
echo $n, '--', $m, '<hr>';
////////////////////////////////////////
$n = 1;
$m = -1;
if ($t = --$n || ++$m) {
	$t++;
	$n++;
	$m++;
}
var_dump($t); //false
var_dump($n); //0
var_dump($m); //0
echo '<hr>';