<?php
/**
 * Created by PhpStorm.
 * User: lxgzhw
 * Date: 1/13/19
 * Time: 4:03 AM
 */

/**
 * 原始数据类型:
 *      数据类型最多的,最细的.
 *      标量类型:
 *          一个变量当中存储一个数据
 *          布尔类型
 *              true 真
 *              false 假
 *          整数类型
 *          浮点数类型
 *          字符串类型
 *              字母
 *              汉字
 *              符号
 *      复合类型:
 *          一个变量当中存储多个数据或多种数据
 *      特殊类型:
 *          空值 null
 *          资源类型 resource
 *
 * 伪类型:
 *      总共6种伪类型
 *
 *
 */

//原始数据类型:3种 标量类型 复合类型 特殊类型
//伪类型:6种

//{}防止变量冲突 字符串中的变量用{}括起来