"""
甲乙两人投篮,投中的概率分别为0.6,0.7,今各投3次,求
    1.两人投中次数相等的概率
    2.甲比乙投中次数多的概率

"""

"""
参考答案

X:甲投中的次数
    可能取值:
        0,1,2,3
Y:乙投中的次数
    可能取值:
        0,1,2,3
根据题意:
X~B(3,0.6)
Y~B(3,0.7)


X与Y的分布律如下

X   0       1       2       3
---------------------------------
P   0.064   0.288   0.432   0.216

Y   0       1       2       3
---------------------------------
P   0.027   0.189   0.441   0.343

分布结束以后的所有概率和为1
二项分布的概率公式
    前提是对立事件 
    投m次中n次的概率为投中概率的n次方加上未投中概率的m-n次方
        C_n_m=p**n+(1-p)**(m-n)
        3次里面0次投中
            C_0_3=0.6**0+0.4**3
        3次里面1次投中
            C_1_3=0.6**1+0.4**2
        3次里面2次投中
            C_2_3=0.6**2+0.4**1
        3次里面3次投中
            C_3_3=0.6**3+0.4**0
    
1.投中次数相等的概率为
    P(X=Y)=P(X=0∩Y=0)+P(X=1∩Y=2)+P(X=2∩Y=2)+P(X=3∩Y=3)
    由于是相互独立事件,概率交集为概率乘积
    P(X=Y)=P(X=0)*P(Y=0)+P(X=1)*P(Y=1)+P(X=2)*P(Y=2)+P(X=3)*P(Y=3)
    通过分布律带入值
    P(X=Y)=0.064*0.027+0.288*0.189+0.432*0.441+0.216*0.343
    P(X=Y)=0.32076
2.甲比乙投中次数多的概率为
    P(X>Y)=P(X=1)*P(Y<1)+P(X=2)*P(Y<2)+P(X=3)*P(Y<3)
    根据分布律
    P(X>Y)=0.288*0.027+0.432*(0.027+0.189)+0.216*(0.027+0.189+0.441)
    P(X>Y)=0.243
"""
# 借助python进行计算
print(0.064 * 0.027 + 0.288 * 0.189 + 0.432 * 0.441 + 0.216 * 0.343)
print(0.288 * 0.027 + 0.432 * (0.027 + 0.189) + 0.216 * (0.027 + 0.189 + 0.441))
