"""
操作系统

见过哪些操作系统
    Windows
    MacOS
    Linux
    Android
    Unix
    iOS

无人机,机器人,都有一个小型的操作系统
    操作系统是我人工只能路上必须要学习并掌握的技能

笔记本或裸机,必须要安装上操作系统
操作系统上的是应用软件
而系统属于系统软件

硬件:
    鼠标,键盘,显示器,声卡...
软件:
    操作系统,qq,微信...


场景:
    一个男人,一个女人,异地,通过手机或其他设备联系
    服务和服务之间的区别,是网卡...

写文档:
    保存:
        本质上是调用的操作系统,将文件保存在磁盘上
内核:
    很多都是驱动程序:
        驱动程序是直接和硬件打交道的程序

应用程序是使用最多的软件

命令行:
    不需要图标,直接通过命令就能够操作
    用户输入命令

比如:
    查看文件
    查看ip

操作系统的作用:
    进程管理
    安装软件
    管理硬件设备
    编译程序4
    文件管理
    内存管理

不同应用领域的主流操作系统
    桌面操作系统
    服务器操作系统
    嵌入式操作系统
    移动设备操作系统

桌面操作系统
    Windows系列
        用户群体大
    MacOS
服务器操作系统
    Linux
        免费,开源,安全,稳定
        占有率高
        几年不关机都没事
    WindowsServer
    服务器装在机柜里面,一台机柜可以装很多服务器

虚拟机
    装一个虚拟机,在这个虚拟机里面再装上Linux系统
    虚拟机完全独立,不会对外部的系统造成任何影响

发行版:
    在内核的基础上安装一堆个性化的软件,就是发行版了
ubuntu:
    搜索到的应用,可以直接拖动到任务栏
"""
