"""
Node.js 是什么

是一种服务器

企业需求:
    具有服务端开发经验更好
    front-end
        前端
    back-end
        后端
    全栈工程师
        全干
    移动端,也是前端的一种
"""

"""
图
                    web后台服务器
客户端发起请求------>>> 页面|接口------>>>数据库
            <<<------- 响应结果
            
node只是一个工具,目的是帮我们与服务器进行交互
学习Node.js的目的就是帮助大家打开服务端这个黑盒子
只有懂了,才能够更好的配合服务端进行开发:
    比如:
        接口怎么制定
        数据怎么开发
目标:
    掌握基本的网站开发能力:
        服务端
        前端
        运维部署
            一个网站从0到1
时间:
    6天
案例:
    多人社区网站
    不再是前端:
        前后端都做
        先手:非常有成就感
        node.js在中国的社区
"""
