
show tables;
-- 删除表
drop table my_life;
-- 一张表记录我生命中遇到过的
create table my_life(
 id int primary key not null auto_increment,
 name varchar(32) not null default '生命中出现过的人',
 my_age int not null default 15,
 age int not null default 15,
 address varchar (32) default '贵州铜仁'
) charset=utf8;

show tables;

-- 插入一条数据
insert  into my_life(name,my_age,age,address) values
('杨雪冬',13,25,'贵州沿河');

select name from my_life;
-- 插入多条数据
insert  into my_life(name,my_age,age,address) values
('杨雪冬',13,25,'贵州沿河'),
('张永',13,27,'贵州沿河'),
('宋秋艳',10,25,'贵州沿河'),
('杨虎刚',13,25,'贵州沿河'),
('张双',11,25,'贵州沿河'),
('段飞莎',11,25,'贵州沿河'),
('陈霞',11,25,'贵州沿河'),
('毛桃',14,25,'贵州沿河'),
('陈俊',14,25,'贵州沿河'),
('罗一民',14,25,'贵州沿河'),
('张德军',14,25,'贵州沿河'),
('王精灵',14,25,'贵州沿河'),
('张小芳',14,25,'贵州沿河'),
('龙学飞',14,25,'贵州沿河'),
('罗方艳',14,25,'贵州沿河'),
('左参',14,25,'贵州沿河'),
('张杰',14,25,'贵州沿河'),
('张莎',14,25,'贵州沿河'),
('张小勇',14,25,'贵州沿河'),
('陈朝江',14,25,'贵州沿河'),
('杨航',14,25,'贵州铜仁'),
('杨梅艺',14,25,'贵州铜仁'),
('杨梅艺',14,25,'贵州铜仁'),
('刘晓丹',14,25,'贵州铜仁'),
('王秦',14,25,'贵州铜仁'),
('向佳韵',14,25,'贵州铜仁'),
('张瑾',14,25,'贵州铜仁'),
('韩乐萌',14,25,'北京昌平'),
('张克',14,25,'北京昌平'),
('高张宇',14,25,'北京昌平'),
('陈之欢',14,25,'北京昌平'),
('黄凯',14,25,'北京昌平');


select name from my_life;