<?php

$a = mt_rand(1 , 100);
$a = 60;

echo "本次成绩是：{$a}";
echo "<br>";

// if($a == 100){
// 	echo "恭喜您获得满分成就";

// }elseif ($a >= 90 && $a < 100) {
// 	echo "恭喜您获得优秀成就"; 

// }elseif ($a >= 80 && $a < 90) {
// 	echo "这次你的成绩还凑合";

// }elseif ($a >= 70 && $a < 80) {
// 	echo "该好好继续敲代码了";
// 		70-75 76-79
// 		

// }elseif ($a >= 60 && $a < 70) {
// 	echo "别吃饭睡觉了，该干嘛干嘛吧";

// }else{
// 	echo "跟着我再来一个月";
// }
// 



// if($a == 100){
// 	echo "恭喜您获得满分成就";

// }elseif ($a >= 90) {
// 	echo "恭喜您获得优秀成就"; 

// }elseif ($a >= 80) {
// 	echo "这次你的成绩还凑合";

// }elseif ($a >= 70) {
// 	echo "该好好继续敲代码了";

// }elseif ($a >= 60) {
// 	echo "别吃饭睡觉了，该干嘛干嘛吧";

// }else{
// 	echo "跟着我再来一个月";
// }
// 

// if ($a < 60) {
// 	echo "跟着我再来一个月";

// } elseif ($a < 70) {
// 	echo "别吃饭睡觉了，该干嘛干嘛吧"; 

// } elseif ($a < 80) {
// 	echo "该好好继续敲代码了";

// } elseif ($a < 90) {
// 	echo "这次你的成绩还凑合";

// } elseif ($a < 100) {
// 	echo "恭喜您获得优秀成就";

// } else{
// 	echo "恭喜您获得满分成就";
// }
//  
// 


总结：
	1，实现效果的方式有多种，尽量使用逻辑严谨且代码简洁的方法

	2，最后一个else之后没有条件，也就是没有()

	3，if结构，也有自己的代码规范