"""
不同形状之间符合一定的条件也可以进行计算

两个数组的形状在某一个维度上是一样的就可以计算
    平面上要求线的长度一样
    立体上要求面的形状一样
"""
import numpy

n1 = numpy.arange(0, 3)
n2 = numpy.arange(0, 9).reshape((3, 3))

# 相加
print(n1 + n2)
print("--" * 22)
print(n1 - n2)
print("--" * 22)
print(n1 * n2)
print("--" * 22)
"""
通过测试不难发现
[[ 0  2  4]
 [ 3  5  7]
 [ 6  8 10]]
--------------------------------------------
[[ 0  0  0]
 [-3 -3 -3]
 [-6 -6 -6]]
--------------------------------------------
[[ 0  1  4]
 [ 0  4 10]
 [ 0  7 16]]
--------------------------------------------

是按照面的方式盖上去,对应值分别进行运算,不断递归,直到不再有值
"""
