<?php
// 一维关联二维索引的数组，转化为一维索引二维关联的数组
// 

// 核心思想：将原数组一维二维键位调换，生成新的数组
// 
// 
// 通过双层foreach循环实现
// 
// 第一次循环，获取到关联键位，以及数组

// 此数组为，索引数组，再遍历该数组，

// 第二层的循环，生成的数组，第一次只能有外层第一次循环获取到的键位，数据为该键位对应的数据

// 外层循环一次，新数组的二维数组，只有一条信息

// 外层第二次循环，新数组的二维数组，就又多了一条信息

// 如此周而复始，外层完成所有遍历，新数组的二维数组，获得所有相应信息





$a = [
	["id" => 1, "name" => "李金星", "age" => "18", "sex" => "男", "addr" => "西安"],
	["id" => 2, "name" => "孔宁豪", "age" => "35", "sex" => "男", "addr" => "山西"],
	["id" => 3, "name" => "戴文龙", "age" => "20", "sex" => "男", "addr" => "杭州"],
	["id" => 4, "name" => "刘帅", "age" => "25", "sex" => "男", "addr" => "北京"],
	["id" => 5, "name" => "于帆", "age" => "22", "sex" => "男", "addr" => "青岛"],
	["id" => 6, "name" => "李博", "age" => "25", "sex" => "女", "addr" => "洛阳"],
];

$b = [
	"id" => [1,2,3,4,5,6],
	"name" => ["李金星","孔宁豪","戴文龙","刘帅","于帆","李博"],
	"age" => [18,35,20,25,22,25],

];

echo "<pre>";
print_r($a);
echo "<hr>";
print_r($b);
echo "</pre>";

// $a[0]["id"] = 1 
// $a[0]["name"] = 李金星 
// $a[0]["age"] = 18

// $b["id"][0] = 1 
// $b["name"][0] = 李金星
// $b["age"][0] = 18 
// 
$c = [];

foreach ($b as $k => $v) {
// 第一次循环，$k -- id  $v 数组
// 第二次循环，$k -- name  $v 数组


	foreach ($v as $kk => $vv) {
		// 1，$kk -- 0  $vv 1
		// 2, $kk -- 1  $vv 2
		// 
		
		// 1，$kk -- 0 $vv -- 李金星
		// 1，$kk -- 1 $vv -- 孔宁豪

		$c[$kk][$k] = $vv;
	}
}


// 一，1 $c[0]["id"] = 1 ;
// 一，2 $c[1]["id"] = 2 ;
// 一，3 $c[2]["id"] = 3 ;
// 一，4 $c[3]["id"] = 4 ;
// 一，5 $c[4]["id"] = 5 ;
// 一，6 $c[5]["id"] = 6 ;
// 
// 
//二，1 $c[0]["name"]= 李金星; 
//二，2 $c[1]["name"]= 孔宁豪; 
//二，2 $c[2]["name"]= 戴文龙; 
//二，2 $c[3]["name"]= 刘帅; 
//二，2 $c[4]["name"]= 于帆; 
//二，2 $c[5]["name"]= 李博; 
//


// $c[0]["id"] = 1 ;
// $c[1]["id"] = 2 ;
// $c[2]["id"] = 3 ;
// $c[3]["id"] = 4 ;
// $c[4]["id"] = 5 ;
// $c[5]["id"] = 6 ;

// $c[0]["name"]= 李金星; 
// $c[1]["name"]= 孔宁豪; 
// $c[2]["name"]= 戴文龙; 
// $c[3]["name"]= 刘帅; 
// $c[4]["name"]= 于帆; 
// $c[5]["name"]= 李博;




echo "<pre>";
print_r($c);
echo "</pre>";